// ConsoleApplication1.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
/*【问题描述】

已知两人分别执白棋和黑棋在一个围棋棋盘上下五子棋，若同一颜色的棋子在同一条横行、
纵行或斜线上连成5个棋子，则执该颜色棋子的人获胜。编写程序读入某一时刻下棋的状态，
并判断是否有人即将获胜，即：同一颜色的棋子在同一条横行、纵列或斜线上连成4个棋子，且该4个棋子的两端至少有一端为空位置。
输入的棋盘大小是19*19，用数字0表示空位置（即没有棋子），用数字1表示该位置下了一白色棋子，
用数字2表示该位置下了一黑色棋子。假设同一颜色的棋子在同一条横行、纵列或斜线上连成的棋子个数不会超过4个，并且最多有一人连成线的棋子个数为4。

【输入形式】

从控制台输入用来表示棋盘状态的数字0、1或2；每行输入19个数字，各数字之间以一个空格分隔，每行最后一个数字后没有空格；共输入19行表示棋盘状态的数字。

【输出形式】

若有人即将获胜，则先输出即将获胜人的棋子颜色（1表示白色棋子，2表示黑色棋子），然后输出英文冒号:，
最后输出连成4个棋子连线的起始位置（棋盘横行自上往下、纵列自左往右从1开始计数，
横行最小的棋子在棋盘上的横行数和纵列数作为连线的起始位置，若在同一行上，则纵列数最小的棋子位置作为起始位置，
两数字之间以一个英文逗号,作为分隔符）。
若没有人获胜，则输出英文字符串：No。
无论输出什么结果，最后都要有回车换行符。

【输入样例1】

0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 2 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 2 0 1 1 2 0 0 0 0 0 0 0
0 0 0 0 0 2 1 1 1 1 2 2 0 0 0 0 0 0 0
0 0 0 0 0 0 0 1 2 1 2 0 0 0 0 0 0 0 0
0 0 0 0 0 0 1 1 0 2 2 0 0 0 0 0 0 0 0
0 0 0 0 0 2 0 1 0 0 2 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 1 2 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
【输出样例1】

1:9,8
【输入样例2】

0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 1 2 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 1 2 2 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
【输出样例2】

No*/
#include <iostream>
#include<vector>
using namespace std;


bool r(int a[19][19],int i,int j) {
    

    if (j >= 15) {
        return false;
    }
    else {
        if (( a[i][j + 1]== a[i][j])&& ( a[i][j + 2] == a[i][j])&& ( a[i][j + 3] == a[i][j])&&( a[i][j+4] == 0)) {
            
            return true;
        }
        return false;

    }

}
bool rd(int a[19][19], int i, int j) {
   
    if (i>=15||j >= 15) {
        return false;
    }
    else {
        if ((a[i][j] == a[i+1][j + 1]) && (a[i][j] == a[i+2][j + 2]) && (a[i][j] == a[i+3][j + 3]) &&( a[i+4][j + 4] == 0)) {
            return true;
        }

        return false;
    }
}
bool d(int a[19][19], int i, int j) {
    
    if (i >= 15) {
        return false;
    }
    else {
        if ((a[i][j] == a[i+1][j] )&&( a[i][j] == a[i+2][j ]) && (a[i][j] == a[i+3][j ]) &&( a[i+4][j] == 0)) {
            
            return true;
        }

        return false;
    }
}
bool ld(int a[19][19], int i, int j) {
    
    if (i>=15||j <= 4) {
        return false;
    }
    else {
        if ((a[i][j] == a[i+1][j -1]) &&( a[i][j] == a[i+1][j -2]) &&( a[i][j] == a[i+3][j -3]) &&( a[i+4][j -4] == 0)) {
            return true;
        }

        return false;
    }
}

int main()
{
    int matrix[19][19];
    for (int i = 0; i < 19; i++) {
        for (int j = 0; j < 19; j++) {
            cin >> matrix[i][j];
        }
    }
    for (int i = 0; i < 19; i++) {
        for (int j = 0; j < 19; j++) {
            if (matrix[i][j] == 1) {
                if (r(matrix, i, j) ||
                    rd(matrix, i, j) ||
                    d(matrix, i, j) ||
                    ld(matrix, i, j)) {
                    cout << "1:" << i +1<< ',' << j+1;
                    goto start;
                }
            }
            else if (matrix[i][j] == 2) {
                if (r(matrix, i, j) ||
                    rd(matrix, i, j) ||
                    d(matrix, i, j) ||
                    ld(matrix, i, j)) {
                    cout << "2:" << i+1 << ',' << j+1;
                    goto start;
                }
            }
        }
    }
    cout << "No";
start:
    return 0;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
