/*你好，HWCWHer
说明
今天，我们欢聚一堂，以一场算法竞赛的盛宴，欢迎 2024 级新 HWCWHer 的入学。五所学校，各有其底蕴，各有其风采。
你可以自由选择参加新生赛的地点，请仔细阅读下面的介绍，作出你内心的真实选择。

华中科技大学（Huazhong University of Science and Technology），坐落于中国中部的武汉市，是一所享有盛誉的综合性研究型大学以其卓越的学术成就、
深厚的文化底蕴和鲜明的工科特色而闻名遐迩。
学校前身为1952年创办的华中工学院、同济医科大学、武汉城市建设学院等，经过多年的融合与发展，
于2000年由原华中理工大学、同济医科大学、武汉城市建设学院合并组建而成，开启了华中科技大学新的辉煌篇章。

武汉大学（WuHan University），坐落于中国中部历史文化名城------武汉市，是中国最负盛名的综合性研究型大学之一，
素有"中国最美大学"之称。学校历史悠久，文化底蕴深厚，其办学历史可追溯至1893年创办的自强学堂，历经百年风雨，始终与国家民族命运紧密相连，不断追求卓越与卓越。

武汉理工大学（WuHan University of Technology），坐落于九省通衢的湖北省武汉市，是一所历史悠久、底蕴深厚、特色鲜明的大学。
学校的前身可以追溯到1898年创办的湖北工艺学堂，历经一个多世纪的发展变迁，
现已成为一所集工学、理学、文学、管理学、经济学、法学、艺术学、教育学等多学科于一体的综合性大学。

华中师范大学（Central China Normal University），坐落于九省通衢的湖北省武汉市。
学校自1903年创办以来，始终秉承"忠诚博雅、朴实刚毅"的华师精神，致力于培养高素质、全面发展的优秀人才，为中国乃至世界的教育事业和社会进步作出了重要贡献。

华中农业大学（HuaZhong Agricultural University），坐落于湖北省武汉市南湖之滨。
学校自1898年创办以来，始终秉承"勤读力耕，立己达人"的校训精神，致力于农业科技创新与人才培养，为我国乃至全球的农业可持续发展和乡村振兴贡献了卓越力量。

输入格式
无输入。

输出格式
输出一个由大写字母组成的字符串，表示你选择的学校英文简写。*/
#include<iostream>
using namespace std;
int main() {
	cout << "WHU";
	return 0;
}